pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
// Real Time Clock & NVRAM
// Hardware isl1208 of Dallas Maxim
// With interface I2C
#ifndef __PICCPRO__
#define __PICCPRO__
#endif

#if defined(__XC)
#include <xc.h>         /* XC8 General Include File */
#elif defined(HI_TECH_C)
#include <htc.h>        /* HiTech General Include File */
#endif
#include <stdint.h>        /* For uint8_t definition */
#include <stdbool.h>       /* For true/false definition */
#include <stdio.h>
#include "system.h"        /* System funct/params, like osc/peripheral config */
#include "user.h"          /* User funct/params, such as InitApp */
#include "Pulsadores.h"
#include "pwm.h"
#include "adcPic16.h"
#include <string.h>
#include "_isl1208.h"
#include "HardI2C.h"
#include "usart1.h"
#include "LCDGeneric.h"

#define USE_INTERRUPTS 1

///////////////////////////////////////////////////////////////////////////////

void lee_y_transmite_date_and_time(void) {
    isl1208_get_date(&fecha.day, &fecha.month, &fecha.yr, &fecha.dow);
    isl1208_get_time(&horarioactual.hrs, &horarioactual.min, &horarioactual.sec);
}

void Obtiene_tiempo_restante_de_encendido(void) {

    if (fechaenc.dow >= fecha.dow) {
        tiemporestantedias = fechaenc.dow - fecha.dow;
    }
    if (fechaenc.dow < fecha.dow) {
        tiemporestantedias = fechaenc.dow + (7- fecha.dow);
    }
    if (periodoencendido==0) {
        tiemporestantedias = 0;
    }
    if (horarioactual.hrs <= horarioenc.hrs) {
        //si la hora de apagado es mayor que el horario actual significa que estamos en el mismo día
        //solo tengo que restar las horas
        tiemporestantehora.hrs = horarioenc.hrs - horarioactual.hrs;
    } else {
        //sino lo que hago es calcular el tiempo desde el horario actual hasta las 20hs de la noche y a eso le sumoola hora de apagado
        tiemporestantehora.hrs = horarioenc.hrs + (24 - horarioactual.hrs);
        if (tiemporestantedias > 0) {
            tiemporestantedias = tiemporestantedias - 1;
        } else {
            tiemporestantedias = 0;
        }
    }
    if (horarioactual.min <= horarioenc.min) {
        //si los minutos de apagado ee mayor que el minuto actual significa que estamos en la misma hora
        //solo tengo que restar las horas
        tiemporestantehora.min = horarioenc.min - horarioactual.min;
    } else {
        //sino lo que hago es calcular el tiempo desde el horario actual hasta los60 minutos y a eso le sumo los minutosde apagado
        tiemporestantehora.min = horarioenc.min + (60 - horarioactual.min);
        //le resto 1 a las horas
        if (tiemporestantehora.hrs > 0) {
            tiemporestantehora.hrs = tiemporestantehora.hrs - 1;
        } else {
            tiemporestantehora.hrs = 23;
        }
    }



}

void main() {
    TMR1IE = 0; //   disable_interrupts(int_timer1);
    RCIE = 0; //    disable_interrupts(int_rda);
    RBIE = 0;
    INTE = 0; //disable_interrupts(int_ext);
    T0CS = 0; // TMR0 Clock Source Select bit: internal
    PSA = 0; //Prescaler is assigned to the Timer0 module
    OPTION_REGbits.PS = 0b101; //: Prescaler Rate Select bits 1/64
    //setup_timer_1(T1_INTERNAL | T1_DIV_BY_1);
    T1CON = 0; //deshabilito el Timer1
    //configura_USART();
    setup_i2c(I2C_MASTER);

    TRISB = 0b00111111; //Configuro las entradas de las teclas y la entrada del reloj
    PORTB = 0;
    TRISC0 = 0; //Configuro el pin de activacion de la bomba como salida
    TRISD = 0x00;
    PORTD = 0;
    TRISE = 0b00000000;
    PORTE = 0;

    vInitLCD();
    static char * cadena;
    set_periodo_buzzer(); //configuro el pwm para una frecuencia de 2.44khz
    buzzer_on(3);
    __delay_ms(200);
    buzzer_off();
    __delay_ms(200);
    buzzer_on(3);
    __delay_ms(200);
    buzzer_off();

    setADCChannel(MIDECORRIENTE);
    __delay_us(20);
    openADC();

    // <editor-fold defaultstate="collapsed" desc="Lectura de datos guardados en EEPROM">
    periodoencendido = eeprom_read(0);
    if (periodoencendido > TIEMPOMAXIMOPERIODO) periodoencendido = 0;
    tiempoencendido = eeprom_read(1);
    if (tiempoencendido > TIEMPOMAXIMOENCENDIDO) tiempoencendido = 15;
    usa_falla_de_corriente = eeprom_read(2);
    if (usa_falla_de_corriente > 1) usa_falla_de_corriente = 1;
    tiempofalla = eeprom_read(3);
    if (tiempofalla > TIEMPOMAXIMOFALLA)tiempofalla = 5;
    //si se produjo un error en la EEPROM, asigno valores predefinidos
    // </editor-fold>

    // <editor-fold defaultstate="collapsed" desc="Lectura del estado actual del RTC">

    if (ISL1208_ready()) {
        sprintf(cadenaamostrar, "RTC OK");

    } else {
        sprintf(cadenaamostrar, "RTC ERRO");
    };
    tiempoapagadolcd = 15; //enciende el backlight del lcd por 15 segundos
    vBackLightLCD_On();

    vGotoxyLCD(1, 1);
    cadena = cadenaamostrar;
    while (*cadena != '\0')
        vLCD_Putc(*cadena++);

    __delay_ms(500);

    fecha.day = 1;
    fecha.month = 1;
    fecha.yr = 15;
    fecha.dow = 4;

    isl1208SR.Valor = 0x00;
    isl1208SR.Valor = ISL1208_Read_status();
    if (isl1208SR.RTCF) {//Si se reseteo el RTC, envio directamente a configurar la hora
        isl1208_init();
        menuactual = SUBMENU_CONFIGURAHORA;

    } else {

        lee_y_transmite_date_and_time();
        isl1208_get_time_enc(&horarioenc.hrs, &horarioenc.min, &horarioenc.sec);
        isl1208_get_dow_enc(&fechaenc.dow);

        if (isl1208SR.ALM) {
            //Si se activo la alarma cuando estaba apagado el sistema se borra esa bandera
            isl1208SR.ALM = 0; //reseteo la indicacion de alarma del RTC
            ISL1208_Set_status(&isl1208SR.Valor);
            //TODO (implementado no probado )ver si transcurrió el periodoencendido, para activar la bomba cuando corresponda
            //Si se activo la alarma, lo que hago es encender la bomba a la hora grabada,en el mismo dia si la hora actual es menor o al día siguiente si la hora actual es mayor, por única vez
            //desactivando la alarma por dow
            isl1208_set_dow_enc(0x00, 0);
            //
        }
    }
    // </editor-fold>

