pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
    // <editor-fold defaultstate="collapsed" desc="Habilita Interrupciones">

    interruptADC_on();
    INTEDG = 0;
    INTE = 1; // enable_interrupts(int_ext2);
    TMR0IE = 1;
    ADIF = 0;
    INTF = 0; // borro las banderas de interrupcion
    TMR0IF = 0;
    PEIE = 1;
    ei(); //enable_interrupts(global);
    // </editor-fold>

    while (1) {
        // <editor-fold defaultstate="collapsed" desc="Inicia Procesa los menú">

        ////////////////////////////////////////
        switch (menuactual) {
            case MENU_INICIAL:
            {
                if (reseteafallas == FALLARESETEADA) {
                    ultimafalla = NOHUBOFALLA;
                    sprintf(cadenaamostrar, "%1dD%02dH%02dM", tiemporestantedias, tiemporestantehora.hrs, tiemporestantehora.min);
                    // sprintf(cadenaamostrar, cadena_esp);
                } else {
                    if (ultimafalla == HUBOFALLAVOLTAJE) {
                        sprintf(cadenaamostrar, "Falla: V");
                    } else if (ultimafalla == HUBOFALLACORRIENTE) {
                        sprintf(cadenaamostrar, "Falla: C");
                    } else if (ultimafalla == HUBOFALLANIVEL) {
                        sprintf(cadenaamostrar, "Falla: N");
                    }
                }

                break;
            }
            case MENU_MUESTRAHORA_FECHA:
            {
                horario = &horarioactual;
                //Se actualiza lo que se muestra en el display, solamente cuando hay cambios en lo que mostrar

                if (flanco) {
                    sprintf(cadenaamostrar, "%02d:%02d %02d", horarioactual.hrs, horarioactual.min, fecha.dow);
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                } else {
                    sprintf(cadenaamostrar, "%02d %02d   ", horarioactual.hrs, horarioactual.min);
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                }
                break;
            }

            case SUBMENU_CONFIGURAHORA:
            {
                modificafecha = HORA;
                horario = &horarioactual;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET HORA");
                    sprintf(cadenaamostrar2, "%02d:%02d   ", horarioactual.hrs, horarioactual.min);
                } else {
                    sprintf(cadenaamostrar, "SET HORA");
                    sprintf(cadenaamostrar2, "  :%02d   ", horarioactual.min);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAMINUTOS:
            {
                modificafecha = MINUTOS;
                horario = &horarioactual;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET HORA");
                    sprintf(cadenaamostrar2, "%02d:%02d   ", horarioactual.hrs, horarioactual.min);
                } else {
                    sprintf(cadenaamostrar, "SET HORA");
                    sprintf(cadenaamostrar2, "%02d:     ", horarioactual.hrs);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURADIA:
            {
                modificafecha = DIA;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                } else {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "  /%02d/%02d", fecha.month, fecha.yr);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAMES:
            {
                modificafecha = MES;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                } else {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/  /%02d", fecha.day, fecha.yr);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAANIO:
            {
                modificafecha = ANIO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                } else {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/  ", fecha.day, fecha.month);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAHORAENCENDIDO:
            {
                modificafecha = HORA;
                horario = &horarioenc;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "%02d:%02d   ", horarioenc.hrs, horarioenc.min);
                } else {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "  :%02d   ", horarioenc.min);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAMINUTOSENCENDIDO:
            {
                modificafecha = MINUTOS;
                horario = &horarioenc;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "%02d:%02d   ", horarioenc.hrs, horarioenc.min);
                } else {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "%02d:     ", horarioenc.hrs);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAPERIODOENCENDIDO:
            {
                modificafecha = PERIODOENCENDIDO;

