pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "ENC: %02d'", tiempoencendido);
                    sprintf(cadenaamostrar2, "c/%u dias", periodoencendido + 1);
                } else {
                    sprintf(cadenaamostrar, "ENC: %02d'", tiempoencendido);
                    sprintf(cadenaamostrar2, "c/  dias");
                }
                bandera_graba_periodoytiempoencendido = 1;
                break;
            }

            case SUBMENU_CONFIGURATIEMPOENCENDIDO:
            {
                modificafecha = TIEMPOENCENDIDO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "ENC: %02d'", tiempoencendido);
                    sprintf(cadenaamostrar2, "c/%u dias", periodoencendido + 1);
                } else {
                    sprintf(cadenaamostrar, "ENC:   '");
                    sprintf(cadenaamostrar2, "c/%u dias", periodoencendido + 1);
                }
                bandera_graba_periodoytiempoencendido = 1;
                break;
            }
            case MENU_CONFIGURAFALLACORRIENTE:
            {
                modificafecha = SINO;
                banderasino = &usa_falla_de_corriente;
                if (flanco || haycambio) {
                    if (usa_falla_de_corriente) {
                        sprintf(cadenaamostrar, "FC:   SI");
                        sprintf(cadenaamostrar2, cadena_esp);
                    } else {
                        sprintf(cadenaamostrar, "FC:   NO");
                        sprintf(cadenaamostrar2, cadena_esp);
                    }
                } else {
                    sprintf(cadenaamostrar, "FC:     ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_usa_falla_de_corriente = 1;
                break;
            }
            case MENU_CONFIGURATIEMPOFALLACORRIENTE:
            {
                modificafecha = TIEMPOFALLA;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "TFC: %02d'", tiempofalla);
                    sprintf(cadenaamostrar2, cadena_esp);
                } else {
                    sprintf(cadenaamostrar, "TFC:   '");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_tiempofalla = 1;
                break;
            }
            case MENU_MUESTRAMEDICIONES:
            {
                //convierto el valor decimal a float
                //para una entrada de 3.3V la lectura es 1023
                //para 0 V la lectura es 0
                //para una maxima lectura quiero que en el display se observe 50A
                //Deseo que tambien me muestre 1 decimal, separo la parte entera y la decimal
                //como la resolucion es 1024, cada bit corresponde a 50A/1024=0.048828125A
                //cada 20 muestras tengo aproximdamente 1A

                adcenteroI = (signed int) mediciondecorriente;
                adcdecimalI = (signed int) ((mediciondecorriente - (signed int) mediciondecorriente)*10);
                sprintf(cadenaamostrar, "%2i.%iA   ", (signed int) adcenteroI, (signed int) adcdecimalI);
                sprintf(cadenaamostrar2, "%3uV    ", (unsigned int) adcenteroV);
                break;
            }
            default:
                break;
        };
        //////////////////////////////////////////////////////////
        //Finaliza Procesa los menú
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Muestra estado de la bomba">
        /////////////////////////////////////////////////////////
        if (menuactual == MENU_INICIAL) {
            switch (estadobomba) {
                case BOMBAAPAGADA:
                {
                    sprintf(cadenaamostrar2, "     off");
                    break;
                }
                case BOMBAENCENDIDA:
                {
                    sprintf(cadenaamostrar2, "      on");
                    break;
                }
                default:
                    break;
            }
            switch (manual_automatico) {
                case MANUAL:
                {
                    strncpy(cadenaamostrar2, "MAN:", 4);
                    break;
                }
                case AUTOMATICO:
                {
                    strncpy(cadenaamostrar2, "AUT:", 4);
                    break;
                }
                default:
                    break;
            }
        }
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Verifica estados de falla">

        if (!usa_falla_de_corriente) {
            estadofallacorriente = CORRIENTENORMAL;
            //TODO Agregado el uso o no de falla de corriente (probar si funciona)
        } else {
            if (estadofallacorriente == FALLACORRIENTE) {
                reseteafallas = FALLAPRESENTE;
                ultimafalla = HUBOFALLACORRIENTE;
                if (estadobomba == BOMBAAPAGADA) {
                    estadofallacorriente = CORRIENTENORMAL;
                }
            }
        }
        if (estadonivel == NIVELBAJO) {
            reseteafallas = FALLAPRESENTE;
            ultimafalla = HUBOFALLANIVEL;
            if (estadobomba == BOMBAAPAGADA) {
                estadonivel = NIVELNORMAL;
            }
        }
        if (estadofallavoltaje == FALLAVOLTAJE) {
            reseteafallas = FALLAPRESENTE;
            ultimafalla = HUBOFALLAVOLTAJE;
        }
        if ((estadonivel == NIVELNORMAL) && (estadofallacorriente == CORRIENTENORMAL) && (estadofallavoltaje == VOLTAJENORMAL)) {


        } else {
            activabomba = APAGABOMBA;
        }
        //////////////////////////////////////////////////////
        //Fin Verifica estados de falla
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Inicio de procesamiento de medicion de voltaje, corriente">
        //Inicio de procesamiento de medicion de voltaje, corriente
        /////////////////////////////////////////////////////////////
        //convierto el valor decimal a float
        //para una entrada de 3.3V la lectura es 1023
        //para 0 V la lectura es 0
        //para una maxima lectura quiero que en el display se observe 50A
        //Deseo que tambien me muestre 1 decimal, separo la parte entera y la decimal
        //como la resolucion es 1024, cada bit corresponde a 50A/1024=0.048828125A
        //cada 20 muestras tengo aproximdamente 1A
        mediciondevoltaje = (float) medidaV_adc * 440 / 1024;
        adcenteroV = (unsigned int) mediciondevoltaje;
        //Se lee el voltaje de alimentación constantemente
        if (adcenteroV <= VOLTAJEMAXIMO && adcenteroV >= VOLTAJEMINIMO) {
            estadofallavoltaje = VOLTAJENORMAL;
        } else {
            estadofallavoltaje = FALLAVOLTAJE;
        }
        mediciondecorriente = (float) medidaI_adc * 50 / 1024 - OFFSET_I;
        /////////////////////////////////////////////////////////////
        //Fin de procesamiento de medicion de voltaje, corriente
        // </editor-fold>

