pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
        // <editor-fold defaultstate="collapsed" desc="Activa o desactiva la Bomba">
        //Activa o desactiva la Bomba
        ///////////////////////////////////////////////////////
        switch (activabomba) {
            case ENCIENDEBOMBA:
            {
                salidabomba = 1;
                estadobomba = 1;
                // vBackLightLCD_On();
                break;
            }
            case APAGABOMBA:
            {
                salidabomba = 0;
                estadobomba = 0;
                // vBackLightLCD_Off();
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Activa o desactiva la Bomba
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Procesa Alarma">
        //Inicio Procesa Alarma
        ///////////////////////////////////////////////////////
        switch (alarma_encendido) {
            case NOALARMA:
            {
                break;
            }
            case SIALARMA:
            {
                if (manual_automatico == AUTOMATICO) {
                    bandera_orden_Alarma_bomba = 1;
                    buzzer_on(3);
                } else {
                    bandera_orden_Alarma_bomba = 0;
                }
                alarma_encendido = NOALARMA;
                isl1208SR.Valor = ISL1208_Read_status();
                isl1208SR.ALM = 0; //reseteo la indicacion de alarma del RTC

                ISL1208_Set_status(&isl1208SR.Valor);
                //Leo el valor de la alarma
                isl1208_get_time_enc(&horarioenc.hrs, &horarioenc.min, &horarioenc.sec);
                isl1208_get_dow_enc(&fechaenc.dow);
                /*TODO (implementado no probado )aca debo sumarle a fecha.dow el valor de periodoencendido
                 * para que respete cada cuantos dias se enciende la bomba
                 por ejemplo si la alarma se activo el lunes (1) y periodoencendido+1=3+1 es cada cuatro dias 4
                 debo hacer 1+4=5, 5%7=5 se deberia encender el viernes (5)
                 otro ejemplo si se encendio el jueves (4) y es cada 4 dias, 4+4=8, entonces 8%7=1 (lunes)
                 periodoencendido va de 0 a 6
                 0 corresponde a dia por dia (se debe desactivar la alarma por dow)
                 1 corresponde a cada dos dias
                 2 cada 3 dias
                 ...
                 6 cada 7 dias
                 */
                fechaenc.dow = (fecha.dow + periodoencendido + 1) % 7;
                isl1208_set_dow_enc(&fechaenc.dow, periodoencendido);
                horarioapagado.Valor = horarioenc.Valor;
                if (horarioapagado.min + tiempoencendido >= 60) {
                    horarioapagado.min = horarioapagado.min + tiempoencendido - 60;
                    if (horarioapagado.hrs == 23) {
                        horarioapagado.hrs = 0;
                    } else {
                        horarioapagado.hrs++;
                    }
                } else {
                    horarioapagado.min = horarioapagado.min + tiempoencendido;
                }
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Procesa Alarma
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Verifica secuencia de arranque">
        /*para que el motor arranque se debe cumplir que:
         * el voltaje sea normal,
         * si está en manual, se haya pulsado el boton on_off
         * si está en automatico se haya activado la alarma por interrupcion
         * el nivel no sea bajo,
         * la corriente sea normal, por lo menos despues de un tiempo despues del arranque
         */
        if (estadofallavoltaje == VOLTAJENORMAL) {
            if (manual_automatico == MANUAL) {
                if (bandera_orden_on_off_bomba) {
                    if (indica_secuencia_arranque == 0) {
                        if (tiempo_secuencia_arranque == 0) {
                            activabomba = ENCIENDEBOMBA; //Enciendo la bomba para empezar a medir la corriente
                            estadofallacorriente = CORRIENTENORMAL;
                            estadonivel = NIVELNORMAL;
                            tiempo_secuencia_arranque = TIEMPOSECUENCIAARRANQUE;
                        } else {
                            // Una vez que se activo la bomba debo ver el estado de la corriente  para ver si no se pasa de los valores normales
                            if (mediciondecorriente <= CORRIENTEMAXIMA) {
                                estadofallacorriente = CORRIENTENORMAL;
                            } else {
                                estadofallacorriente = FALLACORRIENTE;
                            }

                        }
                    } else {
                        //ya finalizo la secuencia de arranque, entonces veo si se estabilizó la corriente
                        if (mediciondecorriente <= CORRIENTENORMALMAXIMA) {
                            estadofallacorriente = CORRIENTENORMAL;
                            cuenta_tiempofalla = 0;
                        } else {
                            //aca verifica si la falla está presente mucho tiempo con tiempofalla
                            if (indica_tiempo_falla == 0) {
                                if (cuenta_tiempofalla == 0) {
                                    cuenta_tiempofalla = tiempofalla;
                                }
                            } else {
                                //Expiro el tiempo de falla con una falla de sobrecorriente, debo apagar la bomba
                                estadofallacorriente = FALLACORRIENTE;
                                indica_tiempo_falla = 0;
                                cuenta_tiempofalla = 0;
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_on_off_bomba = 0; //cambia la bandera de orden de encendido de bomba
                            }


