pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                        }
                        if (mediciondecorriente >= CORRIENTENORMALMINIMA) {
                            estadonivel = NIVELNORMAL;

                        } else {
                            indica_secuencia_arranque = 0;
                            tiempo_secuencia_arranque = 0;
                            bandera_orden_on_off_bomba = 0;
                            estadonivel = NIVELBAJO;
                        }
                    }
                } else {
                    indica_secuencia_arranque = 0;
                    tiempo_secuencia_arranque = 0;
                    activabomba = APAGABOMBA;
                }
            } else {
                if (bandera_orden_Alarma_bomba) {
                    if (indica_secuencia_arranque == 0) {
                        if (tiempo_secuencia_arranque == 0) {
                            activabomba = ENCIENDEBOMBA; //Enciendo la bomba para empezar a medir la corriente
                            estadofallacorriente = CORRIENTENORMAL;
                            estadonivel = NIVELNORMAL;
                            tiempo_secuencia_arranque = TIEMPOSECUENCIAARRANQUE;
                        } else {
                            //Una vez que se activo la bomba debo ver el estado de la corriente  para ver si no se pasa de los valores normales
                            if (mediciondecorriente <= CORRIENTEMAXIMA) {
                                estadofallacorriente = CORRIENTENORMAL;
                            } else {
                                estadofallacorriente = FALLACORRIENTE;
                            }

                        }
                    } else {
                        // ya finalizo la secuencia de arranque, entonces veo si se estabilizó la corriente
                        if (mediciondecorriente <= CORRIENTENORMALMAXIMA) {
                            estadofallacorriente = CORRIENTENORMAL;
                            cuenta_tiempofalla = 0;
                        } else {
                            //aca verifica si la falla está presente mucho tiempo con tiempofalla
                            if (indica_tiempo_falla == 0) {
                                if (cuenta_tiempofalla == 0) {
                                    cuenta_tiempofalla = tiempofalla;
                                }
                            } else {
                                //Expiro el tiempo de falla con una falla de sobrecorriente, debo apagar la bomba
                                estadofallacorriente = FALLACORRIENTE;
                                indica_tiempo_falla = 0;
                                cuenta_tiempofalla = 0;
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_Alarma_bomba = 0; //cambia la bandera de orden de encendido de bomba
                            }


                        }
                        if (mediciondecorriente >= CORRIENTENORMALMINIMA) {
                            estadonivel = NIVELNORMAL;
                            //Acá debo apagar la bomba cuando pase el tiempo de encendido de la bomba
                            if (horarioapagado.hrs == horarioactual.hrs && horarioapagado.min == horarioactual.min) {
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_Alarma_bomba = 0;
                                activabomba = APAGABOMBA;
                            }
                        } else {

                            indica_secuencia_arranque = 0;
                            tiempo_secuencia_arranque = 0;
                            bandera_orden_Alarma_bomba = 0;
                            estadonivel = NIVELBAJO;

                        }
                    }
                } else {
                    indica_secuencia_arranque = 0;
                    tiempo_secuencia_arranque = 0;
                    activabomba = APAGABOMBA;
                }
            }


        }



        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Actualiza Display">
        //Actualiza Display
        /////////////////////////////////////////////
        if (refrescadisplay) {
            vGotoxyLCD(1, 1);
            cadena = cadenaamostrar;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);
            vGotoxyLCD(1, 2);
            cadena = cadenaamostrar2;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);
            haycambio = 0;
            refrescadisplay = 0;
        }
        ////////////////////////////////////////////////
        //Fin Actualiza Display
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Graba datos">
        // <editor-fold defaultstate="collapsed" desc="Graba Nuevos datos en el RTC">
        //Graba Nuevos datos en el RC
        /////////////////////////////////////////////////
        if (bandera_graba_global) {
            if (bandera_graba_hora) {
                if (horario == &horarioactual) {
                    isl1208_set_time((*horario).hrs, (*horario).min, 00);
                    buzzer_on(10);
                }
                if (horario == &horarioenc) {
                    isl1208_set_time_enc((*horario).hrs, (*horario).min, 00);
                    //cuando grabo los datos quiero que toque el dia siguiente o en el mismo dia a la hora especificada
                    //por lo tanto desactivo la alarma por dow
                    //fechaenc.dow = (fecha.dow + periodoencendido + 1) % 7;
                    isl1208_set_dow_enc(0x00, 0);
                    buzzer_on(10);
                }
            }
            if (bandera_graba_fecha) {
                fecha.dow = dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr);
                isl1208_set_date(&fecha.day, &fecha.month, &fecha.yr, &fecha.dow);
                buzzer_on(10);
            }
        }
        //Si no hay datos para grabar en hora y fecha actualizo la hora y la fecha del RTC
        if (actualizo_datos_rtc && bandera_graba_hora == 0 && bandera_graba_fecha == 0) {
            lee_y_transmite_date_and_time();
            isl1208_get_time_enc(&horarioenc.hrs, &horarioenc.min, &horarioenc.sec);
            isl1208_get_dow_enc(&fechaenc.dow);
            Obtiene_tiempo_restante_de_encendido();
            actualizo_datos_rtc = 0;
        }
        bandera_graba_hora = 0;
        bandera_graba_fecha = 0;
        //////////////////////////////////////////////////////////////////
        //Finaliza Graba Nuevos datos en el RTC
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Graba Nuevos datos en la EEPROM DEL PIC">
        //DIRECCION 0: periodoencendido(cada cuanto se enciende la bomba en automatico), de 0 a 6 dias,
        //DIRECCION 1: tiempoencendido (cuanto tiempo permanece encendida la bomba en automatico) 0 a 60 minutos
        //DIRECCION 2: usa_falla_de_corriente (dice si se usa falla de corriente o no)
        //DIRECCION 3: tiempofalla (cuanto tiempo puede estar en falla de corriente antes de apagar la bomba por seguridad) 0 a 10 segundos

        if (bandera_graba_global) {
            di();
            if (bandera_graba_periodoytiempoencendido) {
                eeprom_write(0, periodoencendido);
                eeprom_write(1, tiempoencendido);
                buzzer_on(10);
            }
            if (bandera_graba_usa_falla_de_corriente) {
                eeprom_write(2, usa_falla_de_corriente);
                buzzer_on(10);
            }
            if (bandera_graba_tiempofalla) {
                eeprom_write(3, tiempofalla);
                buzzer_on(10);
            }
            ei();
        }
        bandera_graba_global = 0;
        bandera_graba_periodoytiempoencendido = 0;
        bandera_graba_usa_falla_de_corriente = 0;
        bandera_graba_tiempofalla = 0;
        // </editor-fold>
        // </editor-fold>
        NOP();
        NOP();
    }
}

